wolfSSL/wolfBoot/hal/spi/spi_drv_stm32.h
/* spi_drv_stm32.h
 *
 * wolfBoot is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 3 of the License, or
 * (at your option) any later version.
 *
 * wolfBoot is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1335, USA
 */

#ifndef SPI_DRV_STM32_H_INCLUDED
#define SPI_DRV_STM32_H_INCLUDED

#include <stdint.h>

#ifdef TARGET_stm32f4
#define APB2_CLOCK_ER     (*(volatile uint32_t *)(0x40023844))
#define APB2_CLOCK_RST    (*(volatile uint32_t *)(0x40023824))
#define RCC_GPIO_CLOCK_ER (*(volatile uint32_t *)(0x40023830))
#define GPIOA_BASE (0x40020000)
#define GPIOB_BASE (0x40020400)
#define GPIOC_BASE (0x40020800)
#define GPIOD_BASE (0x40020C00)
#define GPIOE_BASE (0x40021000)
#define SPI_GPIO      GPIOB_BASE
#define SPI_CS_GPIO   GPIOE_BASE
#define SPI_CS_FLASH  1 /* Flash CS connected to GPIOE1 */
#define SPI_CS_TPM    0 /* TPM CS connected to GPIOE0 */
#define SPI_PIN_AF    5 /* Alternate function for SPI pins */
#define SPI_CLOCK_PIN 3 /* SPI_SCK: PB3  */
#define SPI_MISO_PIN  4 /* SPI_MISO PB4  */
#define SPI_MOSI_PIN  5 /* SPI_MOSI PB5  */
#endif /* TARGET_stm32f4 */


#ifdef TARGET_stm32h5
#include "hal/stm32h5.h"

#define APB2_CLOCK_RST     RCC_APB2_CLOCK_RSTR
#define APB2_CLOCK_ER      RCC_APB2_CLOCK_ER
#define RCC_GPIO_CLOCK_ER  RCC_AHB2ENR_CLOCK_ER

/* Nucleo STM32H573ZI SPI_A Port (SPI1) */
#define SPI_CLOCK_PIO_BASE  GPIOA_BASE
#define SPI_MISO_PIO_BASE   GPIOG_BASE
#define SPI_MOSI_PIO_BASE   GPIOB_BASE
#define SPI_CS_TPM_PIO_BASE GPIOD_BASE

#define SPI_PIN_AF    5 /* Alternate function for SPI pins */
#define SPI_CLOCK_PIN 5 /* SPI_SCK: PA5  */
#define SPI_MISO_PIN  9 /* SPI_MISO PG9  */
#define SPI_MOSI_PIN  5 /* SPI_MOSI PB5  */
#define SPI_CS_TPM    14 /* TPM   CS connected to PD14 */
#endif /* TARGET_stm32h5 */


#ifdef TARGET_stm32u5

#ifdef TZEN
#define PERIPH_BASE (0x50000000UL)
#else
#define PERIPH_BASE (0x40000000UL)
#endif

#define OCTOSPI1_BASE (PERIPH_BASE + 0x020D1400UL)
#define OCTOSPI2_BASE (PERIPH_BASE + 0x020D2400UL)

#ifndef OCTOSPI_BASE
#define OCTOSPI_BASE OCTOSPI2_BASE
#endif

/* Registers mapping */
#define APB2PERIPH_BASE (PERIPH_BASE + 0x00012C00UL)
#define RCC_BASE        (PERIPH_BASE + 0x06020C00UL)
#define GPIO_BASE       (PERIPH_BASE + 0x02020000UL)
#define AHB2PERIPH_BASE (PERIPH_BASE + 0x02020000UL)
#define SPI1_BASE       (APB2PERIPH_BASE + 0x3000UL)
#define APB2_CLOCK_ER     (*(volatile uint32_t *)(RCC_BASE + 0xA4))
#define APB2_CLOCK_RST    (*(volatile uint32_t *)(RCC_BASE + 0x7C))
#define AHB2_CLOCK_ER     (*(volatile uint32_t *)(RCC_BASE + 0x90))
#define AHB2_CLOCK_RST    (*(volatile uint32_t *)(RCC_BASE + 0x68))

#define RCC_GPIO_CLOCK_ER (*(volatile uint32_t *)(RCC_BASE + 0x8C))


#define RCC_AHB2ENR_QSPIEN (1 << 8) /* OCTOSPI2 = bit 8, OCTOSPI1 = bit 4 */

#define GPIOA_BASE (GPIO_BASE + 0x00000UL)
#define GPIOB_BASE (GPIO_BASE + 0x00400UL)
#define GPIOC_BASE (GPIO_BASE + 0x00800UL)
#define GPIOD_BASE (GPIO_BASE + 0x00C00UL)
#define GPIOE_BASE (GPIO_BASE + 0x01000UL)
#define GPIOF_BASE (GPIO_BASE + 0x01400UL)
#define GPIOG_BASE (GPIO_BASE + 0x01800UL)
#define GPIOH_BASE (GPIO_BASE + 0x01C00UL)
#define GPIOI_BASE (GPIO_BASE + 0x02000UL)

/** QSPI **/
/* Default Base (H) and AF (alternate function=5) for QSPI */
#define QSPI_GPIO            GPIOH_BASE
#define QSPI_PIN_AF          5

#ifndef QSPI_CLOCK_BASE
#define QSPI_CLOCK_BASE 160000000
#endif

#ifndef QSPI_CLOCK_MHZ
#define QSPI_CLOCK_MHZ  10000000
#endif

/* Default to flash bank 1 */
#ifndef QSPI_FLASH_BANK
#define QSPI_FLASH_BANK      1
#endif

/* Default flash size to 16MB */
#ifndef QSPI_FLASH_SIZE
#define QSPI_FLASH_SIZE      23 /* 2^24 = 16 MB */
#endif

/* QSPI CLK PB2 (alt OCTOSPIM_P1_CLK)*/
#define QSPI_CLOCK_PIO_BASE  GPIOH_BASE
#define QSPI_CLOCK_PIN       6
#define QSPI_CLOCK_PIN_AF    5

/* nQSPI_CS PG6 (alt PB6 -> OCTOSPIM_P1_NCS) */
#ifndef QSPI_ALT_CONFIGURATION
#define QSPI_CS_PIO_BASE     GPIOH_BASE
#define QSPI_CS_FLASH_PIN    5
#else
#define QSPI_CS_PIO_BASE     GPIOH_BASE
#define QSPI_CS_FLASH_PIN    6
#endif

/* QSPI_IO0 */
#define QSPI_IO0_PIO_BASE   GPIOH_BASE
#define QSPI_IO0_PIN        9
#define QSPI_IO0_PIN_AF     5

/* QSPI_IO1 */
#define QSPI_IO1_PIO_BASE   GPIOH_BASE
#define QSPI_IO1_PIN        10
#define QSPI_IO1_PIN_AF     5

/* QSPI_IO2 */
#define QSPI_IO2_PIO_BASE   GPIOH_BASE
#define QSPI_IO2_PIN        11
#define QSPI_IO2_PIN_AF     5

/* QSPI_IO3 */
#define QSPI_IO3_PIO_BASE   GPIOH_BASE
#define QSPI_IO3_PIN        12
#define QSPI_IO3_PIN_AF     5


/* STMOD+ Port */
#define SPI_GPIO      GPIOE_BASE
#define SPI_CS_GPIO   GPIOE_BASE
#define SPI_CS_FLASH  11 /* Flash CS connected to GPIOE11 */
#define SPI_CS_TPM    10 /* TPM   CS connected to GPIOE10 */

#define SPI_PIN_AF    5 /* Alternate function for SPI pins */
#define SPI_CLOCK_PIN 13 /* SPI_SCK: PE13  */
#define SPI_MISO_PIN  14 /* SPI_MISO PE14 */
#define SPI_MOSI_PIN  15 /* SPI_MOSI PE15  */
#endif /* TARGET_stm32u5 */


#ifdef TARGET_stm32wb
#define APB2_CLOCK_ER     (*(volatile uint32_t *)(0x58000060))
#define APB2_CLOCK_RST    (*(volatile uint32_t *)(0x58000040))
#define RCC_GPIO_CLOCK_ER (*(volatile uint32_t *)(0x5800004C))
#define GPIOA_BASE (0x48000000)
#define GPIOB_BASE (0x48000400)
#define GPIOC_BASE (0x48000800)
#define GPIOD_BASE (0x48000C00)

/* STM32WB55 NUCLEO: CN9: D13=SCK, D12=MISO, D11=MOSI, FLASHCS=D10, TPMCS=D9 */
#define SPI_GPIO      GPIOA_BASE
#define SPI_CS_GPIO   GPIOA_BASE
#define SPI_CS_FLASH  4 /* Flash CS connected to GPIOA4 */
#define SPI_CS_TPM    9 /* TPM CS connected to GPIOA9 */
#define SPI_PIN_AF    5 /* Alternate function for SPI pins */
#define SPI_CLOCK_PIN 5 /* SPI_SCK: PA5  */
#define SPI_MISO_PIN  6 /* SPI_MISO PA6  */
#define SPI_MOSI_PIN  7 /* SPI_MOSI PA7  */
#endif /* TARGET_stm32wb */


#ifdef TARGET_stm32l0
#define APB2_CLOCK_ER     (*(volatile uint32_t *)(0x40021034))
#define APB2_CLOCK_RST    (*(volatile uint32_t *)(0x40021024))
#define RCC_GPIO_CLOCK_ER (*(volatile uint32_t *)(0x4002102C))
#define GPIOA_BASE (0x50000000)
#define GPIOB_BASE (0x50000400)

#define SPI_CS_GPIO GPIOB_BASE
#define SPI_PIN_AF    0 /* Alternate function for SPI pins */

