wolfSSL/wolfBoot/hal/spi/spi_drv_stm32.h
#ifndef SPI_ALT_CONFIGURATION
    #define SPI_GPIO      GPIOB_BASE
    #define SPI_CS_FLASH  8 /* Flash CS connected to GPIOB8 */
    #define SPI_CLOCK_PIN 3 /* SPI_SCK: PB3  */
    #define SPI_MISO_PIN  4 /* SPI_MISO PB4  */
    #define SPI_MOSI_PIN  5 /* SPI_MOSI PB5  */
#else
    #define SPI_GPIO      GPIOA_BASE
    #define SPI_CS_FLASH  6 /* Flash CS connected to GPIOB6 */
    #define SPI_CLOCK_PIN 5 /* SPI_SCK: PA5  */
    #define SPI_MISO_PIN  6 /* SPI_MISO PA6  */
    #define SPI_MOSI_PIN  7 /* SPI_MOSI PA7  */
#endif /* SPI_ALT_CONFIGURATION */
#endif /* TARGET_stm32l0 */


#ifdef TARGET_stm32h7

#define RCC_BASE          (0x58024400UL)
#define RCC_GPIO_CLOCK_ER (*(volatile uint32_t *)(RCC_BASE + 0xE0)) /* RM0433 - 8.7.43 (RCC_AHB4ENR) */
#define APB2_CLOCK_ER     (*(volatile uint32_t *)(RCC_BASE + 0xF0)) /* RM0433 - 8.7.47 */
#define APB2_CLOCK_RST    (*(volatile uint32_t *)(RCC_BASE + 0x98)) /* RM0433 - 8.7.35 */

#define DLYB_QSPI_BASE    (0x52006000UL)
#define DLYB_CR(base)     (*(volatile uint32_t *)((base) + 0x00)) /* Control register */
#define DLYB_CFGR(base)   (*(volatile uint32_t *)((base) + 0x04)) /* Configuration register */

#define DLYB_CR_SEN (1 << 1) /* Sampler length enable bit */
#define DLYB_CR_DEN (1 << 0) /* Delay block enable bit */


#define GPIOA_BASE (0x58020000)
#define GPIOB_BASE (0x58020400)
#define GPIOC_BASE (0x58020800)
#define GPIOD_BASE (0x58020C00)
#define GPIOE_BASE (0x58021000)
#define GPIOF_BASE (0x58021400)
#define GPIOG_BASE (0x58021800)
#define GPIOH_BASE (0x58021C00)
#define GPIOI_BASE (0x58022000)
#define GPIOJ_BASE (0x58022400)
#define GPIOK_BASE (0x58022800)


/** QSPI **/
/* Default Base (E) and AF (alternate function=10) for QSPI */
#define QSPI_GPIO            GPIOE_BASE
#define QSPI_PIN_AF          10
/* Default to flash bank 1 (2 for alt) */
#ifndef QSPI_FLASH_BANK
    #ifdef QSPI_ALT_CONFIGURATION
        #define QSPI_FLASH_BANK      2
    #else
        #define QSPI_FLASH_BANK      1
    #endif
#endif
/* Default flash size to 16MB */
#ifndef QSPI_FLASH_SIZE
#define QSPI_FLASH_SIZE      23 /* 2^24 = 16 MB */
#endif

/* QSPI uses hclk3 (240MHz max) by default */
#define RCC_D1CCIPR        (*(volatile uint32_t *)(RCC_BASE + 0x4C)) /* RM0433 - 8.7.19 (RCC_D1CCIPR) */
#define RCC_D1CCIPR_QSPISEL_MASK (0x3 << 4)
#define RCC_D1CCIPR_QSPISEL(sel) (((sel) & 0x3) << 4) /* 0=hclk3, 1=pll1_q_ck, 2=pll2_r_ck, 3=per_ck */
#define RCC_D1CCIPR_QSPISEL_HCLK3 0
#define RCC_D1CCIPR_QSPISEL_PLL1  1
#define RCC_D1CCIPR_QSPISEL_PLL2  2
#define RCC_D1CCIPR_QSPISEL_PERCK 3
#define AHB3_CLOCK_RST     (*(volatile uint32_t *)(RCC_BASE + 0x7C)) /* RM0433 - 8.7.28 - RCC_AHB3RSTR */
#define AHB3_CLOCK_EN      (*(volatile uint32_t *)(RCC_BASE + 0xD4)) /* RM0433 - 8.7.40 - RCC_AHB3ENR */
#define RCC_AHB3ENR_QSPIEN (1 << 14) /* QUADSPI/OCTOSPI clock enabled */

#define HCLK3_MHZ       240000000
#define PERCK_MHZ       64000000
#ifndef QSPI_CLOCK_BASE
#define QSPI_CLOCK_BASE PERCK_MHZ
#endif
#ifndef QSPI_CLOCK_SEL
/* Enable QUADSPI clock on PER_CK (64MHz) */
#define QSPI_CLOCK_SEL  RCC_D1CCIPR_QSPISEL_PERCK
#endif
#ifndef QSPI_CLOCK_MHZ
#define QSPI_CLOCK_MHZ  16000000
#endif

/* QSPI CLK PB2 (alt OCTOSPIM_P1_CLK)*/
#define QSPI_CLOCK_PIO_BASE  GPIOB_BASE
#define QSPI_CLOCK_PIN       2
#define QSPI_CLOCK_PIN_AF    9

/* nQSPI_CS PG6 (alt PB6 -> OCTOSPIM_P1_NCS) */
#ifndef QSPI_ALT_CONFIGURATION
#define QSPI_CS_PIO_BASE     GPIOG_BASE
#define QSPI_CS_FLASH_PIN    6
#else
#define QSPI_CS_PIO_BASE     GPIOB_BASE
#define QSPI_CS_FLASH_PIN    6
#endif

/* QSPI_IO0 (MOSI) - PD11 (alt PE7 -> OCTOSPIM_P1_IO4) */
#ifndef QSPI_ALT_CONFIGURATION
#define QSPI_IO0_PIO_BASE   GPIOD_BASE
#define QSPI_IO0_PIN        11
#define QSPI_IO0_PIN_AF     9
#else
#define QSPI_IO0_PIO_BASE   GPIOE_BASE
#define QSPI_IO0_PIN        7
#endif

/* QSPI_IO1 (MISO) - PD12 (alt PE8 -> OCTOSPIM_P1_IO5) */
#ifndef QSPI_ALT_CONFIGURATION
#define QSPI_IO1_PIO_BASE   GPIOD_BASE
#define QSPI_IO1_PIN        12
#define QSPI_IO1_PIN_AF     9
#else
#define QSPI_IO1_PIO_BASE   GPIOE_BASE
#define QSPI_IO1_PIN        8
#endif

/* QSPI_IO2 - PE2 (alt PE9 -> OCTOSPIM_P1_IO6) */
#ifndef QSPI_ALT_CONFIGURATION
#define QSPI_IO2_PIO_BASE   GPIOE_BASE
#define QSPI_IO2_PIN        2
#define QSPI_IO2_PIN_AF     9
#else
#define QSPI_IO2_PIO_BASE   GPIOE_BASE
#define QSPI_IO2_PIN        9
#endif

/* QSPI_IO3 - PD13 (alt PE10 -> OCTOSPIM_P1_IO7) */
#ifndef QSPI_ALT_CONFIGURATION
#define QSPI_IO3_PIO_BASE   GPIOD_BASE
#define QSPI_IO3_PIN        13
#define QSPI_IO3_PIN_AF     9
#else
#define QSPI_IO3_PIO_BASE   GPIOE_BASE
#define QSPI_IO3_PIN        10
#endif

#endif /* TARGET_stm32h7 */


/* Setup SPI PIO Bases */
#ifndef SPI_CLOCK_PIO_BASE
#define SPI_CLOCK_PIO_BASE SPI_GPIO
#endif
#ifndef SPI_MISO_PIO_BASE
#define SPI_MISO_PIO_BASE  SPI_GPIO
#endif
#ifndef SPI_MOSI_PIO_BASE
#define SPI_MOSI_PIO_BASE  SPI_GPIO
#endif
#ifndef SPI_CS_PIO_BASE
#define SPI_CS_PIO_BASE    SPI_CS_GPIO
#endif
#ifndef SPI_CS_TPM_PIO_BASE
#define SPI_CS_TPM_PIO_BASE SPI_CS_GPIO
#endif

#if defined(QSPI_FLASH) || defined(OCTOSPI_FLASH)
#ifndef QSPI_CS_PIO_BASE
#define QSPI_CS_PIO_BASE    QSPI_CS_GPIO
#endif
#ifndef QSPI_CLOCK_PIO_BASE
#define QSPI_CLOCK_PIO_BASE QSPI_GPIO
#endif
#ifndef QSPI_IO0_PIO_BASE
#define QSPI_IO0_PIO_BASE   QSPI_GPIO
#endif
#ifndef QSPI_IO1_PIO_BASE
#define QSPI_IO1_PIO_BASE   QSPI_GPIO
#endif
#ifndef QSPI_IO2_PIO_BASE
#define QSPI_IO2_PIO_BASE   QSPI_GPIO
#endif
#ifndef QSPI_IO3_PIO_BASE
#define QSPI_IO3_PIO_BASE   QSPI_GPIO
#endif
#endif /* QSPI_FLASH || OCTOSPI_FLASH */

/* Setup alternate functions */
#ifndef SPI_CLOCK_PIN_AF
#define SPI_CLOCK_PIN_AF SPI_PIN_AF
#endif
#ifndef SPI_MISO_PIN_AF
#define SPI_MISO_PIN_AF  SPI_PIN_AF
#endif
#ifndef SPI_MOSI_PIN_AF
#define SPI_MOSI_PIN_AF  SPI_PIN_AF
#endif

#if defined(QSPI_FLASH) || defined(OCTOSPI_FLASH)
#ifndef QSPI_CS_FLASH_AF
#define QSPI_CS_FLASH_AF  QSPI_PIN_AF
#endif

#ifndef QSPI_CLOCK_PIN_AF
#define QSPI_CLOCK_PIN_AF QSPI_PIN_AF
#endif
#ifndef QSPI_IO0_PIN_AF
#define QSPI_IO0_PIN_AF   QSPI_PIN_AF
#endif
#ifndef QSPI_IO1_PIN_AF
#define QSPI_IO1_PIN_AF   QSPI_PIN_AF
#endif
#ifndef QSPI_IO2_PIN_AF
#define QSPI_IO2_PIN_AF   QSPI_PIN_AF
#endif
#ifndef QSPI_IO3_PIN_AF
#define QSPI_IO3_PIN_AF   QSPI_PIN_AF
#endif
#endif /* QSPI_FLASH || OCTOSPI_FLASH */


/* SPI */
#ifndef SPI1_BASE
#define SPI1_BASE (0x40013000) /* SPI1 base address */
#endif

#define SPI1_APB2_CLOCK_ER_VAL     (1 << 12)

#if defined(TARGET_stm32h5)
/* newer SPI/I2S peripheral */
#define SPI1_CR1      (*(volatile uint32_t *)(SPI1_BASE))
#define SPI1_CR2      (*(volatile uint32_t *)(SPI1_BASE + 0x04))
#define SPI1_CFG1     (*(volatile uint32_t *)(SPI1_BASE + 0x08))
#define SPI1_CFG2     (*(volatile uint32_t *)(SPI1_BASE + 0x0C))
#define SPI1_SR       (*(volatile uint32_t *)(SPI1_BASE + 0x14))
#define SPI1_IFCR     (*(volatile uint32_t *)(SPI1_BASE + 0x18))
#define SPI1_TXDR     (*(volatile uint8_t *)(SPI1_BASE + 0x20))
#define SPI1_RXDR     (*(volatile uint8_t *)(SPI1_BASE + 0x30))

#define SPI_CR1_SPI_EN              (1 << 0)
#define SPI_CR1_MASRX               (1 << 8)  /* master automatic suspension in Receive mode */
#define SPI_CR1_CSTART              (1 << 9)  /* Continous start */
#define SPI_CR1_SSI                 (1 << 12) /* Internal slave select signal input level */
#define SPI_CFG1_DSIZE_MASK         (0x1F)
#define SPI_CFG1_DSIZE_SHIFT        (0)
#define SPI_CFG1_FTHLV_MASK         (0x1F)
#define SPI_CFG1_FTHLV_SHIFT        (5)
#define SPI_CFG1_CRCSIZE_MASK       (0x1F)
#define SPI_CFG1_CRCSIZE_SHIFT      (16)
#define SPI_CFG1_BAUDRATE_MASK      (0x07)
#define SPI_CFG1_BAUDRATE_SHIFT     (28)

