wolfSSL/wolfBoot/hal/spi/spi_drv_stm32.h
#define SPI_CFG2_MASTER             (1 << 22)
#define SPI_CFG2_LSBFIRST           (1 << 23)
#define SPI_CFG2_CLOCK_PHASE_SHIFT  (24)
#define SPI_CFG2_CLOCK_POL_SHIFT    (25)
#define SPI_CFG2_SSM                (1 << 26)
#define SPI_CFG2_SSOE               (1 << 29)
#define SPI_CFG2_SSOM               (1 << 30)
#define SPI_CFG2_AFCNTR             (1 << 31) /* alternate function GPIOs control */
#define SPI_CFG2_COMM_MASK          (0x3)     /* 0=full duplex, 1=simplex tx, 2=simplex rx, 3=half duplex */
#define SPI_CFG2_COMM_SHIFT         (17)

#define SPI_IFCR_SUSPC              (1 << 11)
#define SPI_IFCR_MODFC              (1 << 9)
#define SPI_IFCR_TIFREC             (1 << 8)
#define SPI_IFCR_CRCEC              (1 << 7)
#define SPI_IFCR_OVRC               (1 << 6)
#define SPI_IFCR_UDRC               (1 << 5)
#define SPI_IFCR_TXTFC              (1 << 4)
#define SPI_IFCR_EOTC               (1 << 3)

#define SPI_SR_RX_NOTEMPTY          (1 << 0)
#define SPI_SR_TX_EMPTY             (1 << 1)

#else

/* older SPI peripheral */
#define SPI1_CR1      (*(volatile uint32_t *)(SPI1_BASE))
#define SPI1_CR2      (*(volatile uint32_t *)(SPI1_BASE + 0x04))
#define SPI1_SR       (*(volatile uint32_t *)(SPI1_BASE + 0x08))
#define SPI1_DR       (*(volatile uint8_t *)(SPI1_BASE + 0x0c))

#define SPI_CR1_CLOCK_PHASE_SHIFT   (0)
#define SPI_CR1_CLOCK_POL_SHIFT     (1)
#define SPI_CR1_MASTER              (1 << 2)
#define SPI_CR1_BAUDRATE_MASK       (0x07)
#define SPI_CR1_BAUDRATE_SHIFT      (3)
#define SPI_CR1_SPI_EN              (1 << 6)
#define SPI_CR1_LSBFIRST            (1 << 7)
#define SPI_CR1_SSI                 (1 << 8)
#define SPI_CR1_SSM                 (1 << 9)
#define SPI_CR1_16BIT_FORMAT        (1 << 11)
#define SPI_CR1_TX_CRC_NEXT         (1 << 12)
#define SPI_CR1_HW_CRC_EN           (1 << 13)
#define SPI_CR1_BIDIOE              (1 << 14)
#define SPI_CR2_SSOE                (1 << 2)

#define SPI_SR_RX_NOTEMPTY          (1 << 0)
#define SPI_SR_TX_EMPTY             (1 << 1)
#define SPI_SR_BUSY                 (1 << 7)

#endif

/* GPIO */
#define GPIO_MODE(base)    (*(volatile uint32_t *)(base + 0x00)) /* GPIOx_MODER */
#define GPIO_OTYPE(base)   (*(volatile uint32_t *)(base + 0x04)) /* GPIOx_OTYPER */
#define GPIO_OSPD(base)    (*(volatile uint32_t *)(base + 0x08)) /* GPIOx_OSPEEDR */
#define GPIO_PUPD(base)    (*(volatile uint32_t *)(base + 0x0c)) /* GPIOx_PUPDR */
#define GPIO_ODR(base)     (*(volatile uint32_t *)(base + 0x14)) /* GPIOx_ODR */
#define GPIO_BSRR(base)    (*(volatile uint32_t *)(base + 0x18)) /* GPIOx_BSRR */
#define GPIO_AFL(base)     (*(volatile uint32_t *)(base + 0x20)) /* GPIOx_AFRL */
#define GPIO_AFH(base)     (*(volatile uint32_t *)(base + 0x24)) /* GPIOx_AFRH */
#ifndef GPIO_SECCFGR
#define GPIO_SECCFGR(base) (*(volatile uint32_t *)(base + 0x30)) /* GPIOx_SECCFGR */
#endif

#define GPIO_MODE_INPUT  (0)
#define GPIO_MODE_OUTPUT (1)
#define GPIO_MODE_AF     (2)
#define GPIO_MODE_ANALOG (3)


/* QUADSPI */
#ifndef QUADSPI_BASE
#define QUADSPI_BASE      0x52005000UL
#endif

#define QUADSPI_CR                (*(volatile uint32_t *)(QUADSPI_BASE + 0x00)) /* Control register */
#define QUADSPI_DCR               (*(volatile uint32_t *)(QUADSPI_BASE + 0x04)) /* Device Configuration register */
#define QUADSPI_SR                (*(volatile uint32_t *)(QUADSPI_BASE + 0x08)) /* Status register */
#define QUADSPI_FCR               (*(volatile uint32_t *)(QUADSPI_BASE + 0x0C)) /* Flag Clear register */
#define QUADSPI_DLR               (*(volatile uint32_t *)(QUADSPI_BASE + 0x10)) /* Data Length register */
#define QUADSPI_CCR               (*(volatile uint32_t *)(QUADSPI_BASE + 0x14)) /* Communication Configuration register */
#define QUADSPI_AR                (*(volatile uint32_t *)(QUADSPI_BASE + 0x18)) /* Address register */
#define QUADSPI_ABR               (*(volatile uint32_t *)(QUADSPI_BASE + 0x1C)) /* Alternate Bytes register */
#define QUADSPI_DR                (*(volatile uint8_t  *)(QUADSPI_BASE + 0x20)) /* Data register */
#define QUADSPI_DR32              (*(volatile uint32_t *)(QUADSPI_BASE + 0x20)) /* Data register - 32 bit */
#define QUADSPI_PSMKR             (*(volatile uint32_t *)(QUADSPI_BASE + 0x24)) /* Polling Status Mask register */
#define QUADSPI_PSMAR             (*(volatile uint32_t *)(QUADSPI_BASE + 0x28)) /* Polling Status Match register */
#define QUADSPI_PIR               (*(volatile uint32_t *)(QUADSPI_BASE + 0x2C)) /* Polling Interval register */
#define QUADSPI_LPTR              (*(volatile uint32_t *)(QUADSPI_BASE + 0x30)) /* Low Power Timeout register */

#define QUADSPI_CR_PRESCALER_MASK (0xFF << 24)
#define QUADSPI_CR_PRESCALER(pre) ((((pre)-1) & 0xFF) << 24) /* Clock prescaler: quadspi_ker_ck/pre+1 */
#define QUADSPI_CR_FTIE           (1 << 13) /* FIFO threshold interrupt enable */
#define QUADSPI_CR_FTHRES_MASK    (0x1F << 8)
#define QUADSPI_CR_FTHRES(thr)    ((((thr)-1) & 0x1F) << 8) /* FIFO threshold level */
#define QUADSPI_CR_FSEL           (1 << 7)  /* 0=Flash 1 or 1=Flash 2 */
#define QUADSPI_CR_DFM            (1 << 6)  /* Dual-flash mode */
#define QUADSPI_CR_SSHIFT         (1 << 4)  /* Sample shift 1=1/2 cycle shift */
#define QUADSPI_CR_ABORT          (1 << 1)  /* Abort request */
#define QUADSPI_CR_EN             (1 << 0)  /* Enable the QUADSPI */

#define QUADSPI_CCR_DDRM          (1 << 31) /* Double data rate mode */
#define QUADSPI_CCR_DHHC          (1 << 30) /* Delay the data output by 1/4 of the QUADSPI output clock cycle in DDR mode */
#define QUADSPI_CCR_FRCM          (1 << 29) /* Free running clock mode */
#define QUADSPI_CCR_SIOO          (1 << 28) /* Send instruction only once mode */
#define QUADSPI_CCR_FMODE_MASK    (0x3 << 26)
#define QUADSPI_CCR_FMODE(fmode)  (((fmode) & 0x3) << 26)   /* Functional Mode (0=indirect write, 1=indirect read, 2=auto poll, 3=mem mapped) */
#define QUADSPI_CCR_DMODE_MASK    (0x3 << 24)
#define QUADSPI_CCR_DMODE(dmode)  (((dmode) & 0x3) << 24)   /* Data mode (0=no data, 1=data on single line, 2=data on two lines, 3=data on four lines) */
#define QUADSPI_CCR_DCYC_MASK     (0x1F << 18)
#define QUADSPI_CCR_DCYC(dcyc)    (((dcyc) & 0x1F) << 18)   /* Number of dummy cycles */
#define QUADSPI_CCR_ABSIZE_MASK   (0x3 << 16)
#define QUADSPI_CCR_ABSIZE(absz)  (((absz) & 0x3) << 16)    /* Alternate bytes size */
#define QUADSPI_CCR_ABMODE_MASK   (0x3 << 14)
#define QUADSPI_CCR_ABMODE(abmode) (((abmode) & 0x3) << 14) /* Alternate bytes mode (0=no alt data, 1=alt on single line, 2=alt on two lines, 3=alt on four lines) */
#define QUADSPI_CCR_ADSIZE_MASK   (0x3 << 12)
#define QUADSPI_CCR_ADSIZE(sz)    (((sz) & 0x3) << 12)      /* Address bytes size (0=8-bit, 1=16-bit, 2=24-bit, 3=32-bit) */
#define QUADSPI_CCR_ADMODE_MASK   (0x3 << 10)
#define QUADSPI_CCR_ADMODE(admode) (((admode) & 0x3) << 10) /* Address mode (0=no addr, 1=addr on single line, 2=addr on two lines, 3=addr on four lines) */
#define QUADSPI_CCR_IMODE_MASK    (0x3 << 8)
#define QUADSPI_CCR_IMODE(imode)  (((imode) & 0x3) << 8)    /* Instruction mode (0=no instr, 1=instr on single line, 2=instr on two lines, 3=instr on four lines) */
#define QUADSPI_CCR_INSTRUCTION_MASK (0xFF << 0)
#define QUADSPI_CCR_INSTRUCTION(ins) (((ins) & 0xFF) << 0)  /* Instruction to be send to the external SPI device */

#define QUADSPI_DCR_FSIZE_MASK    (0x1F << 16)
#define QUADSPI_DCR_FSIZE(fsz)    (((fsz) & 0x1F) << 16)    /* Flash memory size (2 ^ (fsize + 1)). Example 16MB is 23 */
#define QUADSPI_DCR_CSHT_MASK     (0x7 << 8)
#define QUADSPI_DCR_CSHT(csht)    (((csht) & 0x7) <<  8)    /* Chip select high time - Number of clock cycles (+1) nCS to remain high between commands */
#define QUADSPI_DCR_CKMODE_3      (1 << 0)                  /* Clock mode 3 - clk high while nCS released */
#define QUADSPI_DCR_CKMODE_0      (0)                       /* Clock mode 0 - clk low while nCS released */

#define QUADSPI_SR_TCF            (1 << 1)                  /* Transfer complete flag - set in indirect mode when the programmed number of data has been transferred */
#define QUADSPI_SR_FTF            (1 << 2)                  /* FIFO threshold flag */
#define QUADSPI_SR_BUSY           (1 << 5)                  /* Busy - operation is ongoing when set */


