wolfSSL/wolfBoot/hal/spi/spi_drv_stm32.h
/* OCTOSPI (1=0x5000, 2=0xA000)*/
#ifndef OCTOSPI_BASE
#define OCTOSPI_BASE      0x52005000
#endif

#define OCTOSPI_CR                (*(volatile uint32_t *)(OCTOSPI_BASE + 0x00)) /* Control register */
#define OCTOSPI_DCR1              (*(volatile uint32_t *)(OCTOSPI_BASE + 0x08)) /* Device Configuration register 1 */
#define OCTOSPI_DCR2              (*(volatile uint32_t *)(OCTOSPI_BASE + 0x0C)) /* Device Configuration register 2 */
#define OCTOSPI_DCR3              (*(volatile uint32_t *)(OCTOSPI_BASE + 0x10)) /* Device Configuration register 3 */
#define OCTOSPI_DCR4              (*(volatile uint32_t *)(OCTOSPI_BASE + 0x14)) /* Device Configuration register 4 */
#define OCTOSPI_SR                (*(volatile uint32_t *)(OCTOSPI_BASE + 0x20)) /* Status register */
#define OCTOSPI_FCR               (*(volatile uint32_t *)(OCTOSPI_BASE + 0x24)) /* Flag Clear register */
#define OCTOSPI_DLR               (*(volatile uint32_t *)(OCTOSPI_BASE + 0x40)) /* Data Length register */
#define OCTOSPI_AR                (*(volatile uint32_t *)(OCTOSPI_BASE + 0x48)) /* Address register */
#define OCTOSPI_DR                (*(volatile uint8_t  *)(OCTOSPI_BASE + 0x50)) /* Data register */
#define OCTOSPI_DR32              (*(volatile uint32_t *)(OCTOSPI_BASE + 0x50)) /* Data register - 32 bit */
#define OCTOSPI_PSMKR             (*(volatile uint32_t *)(OCTOSPI_BASE + 0x80)) /* Polling Status Mask register */
#define OCTOSPI_PSMAR             (*(volatile uint32_t *)(OCTOSPI_BASE + 0x88)) /* Polling Status Match register */
#define OCTOSPI_PIR               (*(volatile uint32_t *)(OCTOSPI_BASE + 0x90)) /* Polling Interval register */
#define OCTOSPI_CCR               (*(volatile uint32_t *)(OCTOSPI_BASE + 0x100)) /* Communication Configuration register */
#define OCTOSPI_TCR               (*(volatile uint32_t *)(OCTOSPI_BASE + 0x108)) /* Timing Configuration register */
#define OCTOSPI_IR                (*(volatile uint32_t *)(OCTOSPI_BASE + 0x110)) /* Instruction register */
#define OCTOSPI_ABR               (*(volatile uint32_t *)(OCTOSPI_BASE + 0x120)) /* Alternate Bytes register */
#define OCTOSPI_LPTR              (*(volatile uint32_t *)(OCTOSPI_BASE + 0x130)) /* Low Power Timeout register */

#define OCTOSPI_CR_FMODE_MASK     (0x3 << 28)
#define OCTOSPI_CR_FMODE(fmode)   (((fmode) & 0x3) << 28)  /* Functional Mode (0=indirect write, 1=indirect read, 2=auto poll, 3=mem mapped) */
#define OCTOSPI_CR_FTIE           (1 << 18)                /* FIFO threshold interrupt enable */
#define OCTOSPI_CR_TCIE           (1 << 17)                /* Transfer complete interrupt enable */
#define OCTOSPI_CR_FTHRES_MASK    (0x1F << 8)
#define OCTOSPI_CR_FTHRES(thr)    ((((thr)-1) & 0x1F) << 8) /* FIFO threshold level */
#define OCTOSPI_CR_FSEL           (1 << 7)                 /* 0=Flash 1 or 1=Flash 2 */
#define OCTOSPI_CR_ABORT          (1 << 1)                 /* Abort request */
#define OCTOSPI_CR_EN             (1 << 0)                 /* Enable the QUADSPI */

#define OCTOCPI_DCR1_MTYP_MASK    (0x7 << 24)
#define OCTOCPI_DCR1_MTYP(mtyp)   (((mtyp) & 0x7) << 24)   /* Memory type: 0=Micron, 1=Macronix, 2=Std, 3=Macronix RAM, 4=HyperBus mem, 5=HyperBus reg */
#define OCTOSPI_DCR1_DEVSIZE_MASK (0x1F << 16)
#define OCTOSPI_DCR1_DEVSIZE(dsz) (((dsz) & 0x1F) << 16)   /* Device memory size (2 ^ (fsize + 1)). Example 16MB is 23 */
#define OCTOSPI_DCR1_CSHT_MASK    (0x3F << 8)
#define OCTOSPI_DCR1_CSHT(csht)   (((csht) & 0x3F) << 8)   /* Chip select high time - Number of clock cycles (+1) nCS to remain high between commands */
#define OCTOSPI_DCR1_CKMODE_3     (1 << 0)                 /* Clock mode 3 - clk high while nCS released */
#define OCTOSPI_DCR1_CKMODE_0     (0)                      /* Clock mode 0 - clk low while nCS released */

#define OCTOSPI_DCR2_PRESCALER_MASK (0xFF << 0)
#define OCTOSPI_DCR2_PRESCALER(pre) ((((pre)-1) & 0xFF) << 0) /* Clock prescaler: quadspi_ker_ck/pre+1 */

#define OCTOSPI_SR_TCF            (1 << 1)                 /* Transfer complete flag - set in indirect mode when the programmed number of data has been transferred */
#define OCTOSPI_SR_FTF            (1 << 2)                 /* FIFO threshold flag */
#define OCTOSPI_SR_BUSY           (1 << 5)                 /* Busy - operation is ongoing when set */
#define OCTOSPI_SR_FLEVEL(sr)     (((sr) >> 8) & 0x3F)     /* FIFO level */

#define OCTOSPI_CCR_SIOO          (1 << 31)                /* Send instruction only once mode */
#define OCTOSPI_CCR_DDTR          (1 << 27)                /* Data Double transfer rate mode */
#define OCTOSPI_CCR_DMODE_MASK    (0x7 << 24)
#define OCTOSPI_CCR_DMODE(dmode)  (((dmode) & 0x7) << 24)  /* Data mode (0=no data, 1=data on single line, 2=data on two lines, 3=data on four lines, 4=data on eight lines) */
#define OCTOSPI_CCR_ABSIZE_MASK   (0x3 << 20)
#define OCTOSPI_CCR_ABSIZE(absz)  (((absz) & 0x3) << 20)   /* Alternate bytes size */
#define OCTOSPI_CCR_ABDTR         (1 << 19)                /* Alternate bytes Double transfer rate mode */
#define OCTOSPI_CCR_ABMODE_MASK   (0x7 << 16)
#define OCTOSPI_CCR_ABMODE(abm)   (((abm) & 0x7) << 16)    /* Alternate bytes mode (0=no alt data, 1=alt on single line, 2=alt on two lines, 3=alt on four lines, 4=alt on eight lines) */
#define OCTOSPI_CCR_ADSIZE_MASK   (0x3 << 12)
#define OCTOSPI_CCR_ADSIZE(sz)    (((sz) & 0x3) << 12)     /* Address bytes size (0=8-bit, 1=16-bit, 2=24-bit, 3=32-bit) */
#define OCTOSPI_CCR_ADMODE_MASK   (0x7 << 8)
#define OCTOSPI_CCR_ADMODE(adm)   (((adm) & 0x7) << 8)     /* Address mode (0=no addr, 1=addr on single line, 2=addr on two lines, 3=addr on four lines, 4=addr on eight lines) */
#define OCTOSPI_CCR_ISIZE_MASK    (0x3 << 4)
#define OCTOSPI_CCR_ISIZE(sz)     (((sz) & 0x3) << 4)      /* Instruction size (0=8-bit, 1=16-bit, 2=24-bit, 3=32-bit) */
#define OCTOSPI_CCR_IMODE_MASK    (0x7 << 0)
#define OCTOSPI_CCR_IMODE(imode)  (((imode) & 0x7) << 0)   /* Instruction mode (0=no instr, 1=instr on single line, 2=instr on two lines, 3=instr on four lines, 4=instr on eight lines) */

#define OCTOSPI_TCR_SSHIFT        (1 << 30)                /* Sample shift 1=1/2 cycle shift */
#define OCTOSPI_TCR_DHQC          (1 << 28)                /* Delay the data output by 1/4 of clock cycle */
#define OCTOSPI_TCR_DCYC_MASK     (0x1F << 0)
#define OCTOSPI_TCR_DCYC(dcyc)    (((dcyc) & 0x1F) << 0)   /* Number of dummy cycles */


#endif /* !SPI_DRV_STM32_H_INCLUDED */
